{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "be10f430-5caf-4d50-ba53-aba6c93d46e2",
   "metadata": {},
   "source": [
    "<div style=\"font-size: 24px; line-height: 1.2;\">\n",
    "COMS W4111 -- Introduction to Databases, Spring 2026<br>Lecture 9 Examples\n",
    "</div>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0a0b3d1c",
   "metadata": {},
   "source": [
    "# MongoDB"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7f0efcd6",
   "metadata": {},
   "source": [
    "## Connect"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "19f3945a-3e9d-4165-a013-4ff10fc7f8fe",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "b4ad772b-749b-4491-aef3-cde6494498b2",
   "metadata": {},
   "outputs": [],
   "source": [
    "from pymongo import MongoClient, errors"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "7c65688b-f4e8-4a8d-83b5-e4a84743c0bd",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pymongo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "81dd0e05",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "263f9ad9",
   "metadata": {},
   "outputs": [],
   "source": [
    "mongourl = \"mongodb+srv://dbuser:sBJ1btaxRAWiqfm1@cluster0.t8qdk.mongodb.net/?appName=Cluster0\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "f1b15b13-28a8-45d8-8c6a-ecf13231eb44",
   "metadata": {},
   "outputs": [],
   "source": [
    "# mongourl = \"localhost:27017\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "c33cebb8-3c14-4717-8e71-4411de059eec",
   "metadata": {},
   "outputs": [],
   "source": [
    "client = MongoClient(mongourl)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "d745f2ff-a912-42ee-890f-e0d218be7410",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "✅ Successfully connected to MongoDB Atlas!\n",
      "Server Info: 8.0.20\n",
      "\n",
      "Databases on this cluster:\n",
      " - S25_GoT\n",
      " - classicmodels\n",
      " - f24_project_got\n",
      " - test_database\n",
      " - admin\n",
      " - local\n"
     ]
    }
   ],
   "source": [
    "try:\n",
    "    # Create a MongoClient with a short timeout for quick failure if unreachable\n",
    "    # client = MongoClient(MONGODB_URI, serverSelectionTimeoutMS=5000)\n",
    "\n",
    "    # Attempt to retrieve server information (forces a connection call)\n",
    "    server_info = client.server_info()\n",
    "    print(\"✅ Successfully connected to MongoDB Atlas!\")\n",
    "    print(\"Server Info:\", server_info.get(\"version\", \"Unknown version\"))\n",
    "\n",
    "    # Optional: List available databases\n",
    "    print(\"\\nDatabases on this cluster:\")\n",
    "    for db_name in client.list_database_names():\n",
    "        print(\" -\", db_name)\n",
    "\n",
    "except errors.ServerSelectionTimeoutError as err:\n",
    "    print(\"❌ Could not connect to MongoDB Atlas. Timeout occurred.\")\n",
    "    print(\"Error details:\", err)\n",
    "except errors.OperationFailure as err:\n",
    "    print(\"❌ Authentication failed. Check your username/password.\")\n",
    "    print(\"Error details:\", err)\n",
    "except Exception as err:\n",
    "    print(\"❌ An unexpected error occurred.\")\n",
    "    print(\"Error details:\", err)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0880eca4",
   "metadata": {},
   "source": [
    "## Tutorial"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e8f37183-4003-4270-8bf4-c8df797f9b9e",
   "metadata": {},
   "source": [
    "### The Tutorial"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "67611e25-2c38-4422-ac50-6a21cfa33c85",
   "metadata": {},
   "source": [
    "Let's run the basic MongoDB aggregation [pipeline tutorial.](https://www.mongodb.com/docs/manual/tutorial/aggregation-complete-examples/)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "39a93e03",
   "metadata": {},
   "source": [
    "### Add Test Data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "94c0c97b",
   "metadata": {},
   "outputs": [],
   "source": [
    "from datetime import datetime"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "ddac8521-7769-45c0-985e-88b78e8bea5e",
   "metadata": {},
   "outputs": [],
   "source": [
    "agg_db = client[\"agg_tutorials_db\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "15a668d4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "InsertManyResult([ObjectId('69d01fefc8f9ecfbbec7707d'), ObjectId('69d01fefc8f9ecfbbec7707e'), ObjectId('69d01fefc8f9ecfbbec7707f'), ObjectId('69d01fefc8f9ecfbbec77080'), ObjectId('69d01fefc8f9ecfbbec77081'), ObjectId('69d01fefc8f9ecfbbec77082')], acknowledged=True)"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "person_coll = agg_db[\"persons\"]\n",
    "\n",
    "person_data = [\n",
    "    {\n",
    "        \"person_id\": \"6392529400\",\n",
    "        \"firstname\": \"Elise\",\n",
    "        \"lastname\": \"Smith\",\n",
    "        \"dateofbirth\": datetime(1972, 1, 13, 9, 32, 7),\n",
    "        \"vocation\": \"ENGINEER\",\n",
    "        \"address\": {\n",
    "            \"number\": 5625,\n",
    "            \"street\": \"Tipa Circle\",\n",
    "            \"city\": \"Wojzinmoj\",\n",
    "        },\n",
    "    },\n",
    "    {\n",
    "        \"person_id\": \"1723338115\",\n",
    "        \"firstname\": \"Olive\",\n",
    "        \"lastname\": \"Ranieri\",\n",
    "        \"dateofbirth\": datetime(1985, 5, 12, 23, 14, 30),\n",
    "        \"gender\": \"FEMALE\",\n",
    "        \"vocation\": \"ENGINEER\",\n",
    "        \"address\": {\n",
    "            \"number\": 9303,\n",
    "            \"street\": \"Mele Circle\",\n",
    "            \"city\": \"Tobihbo\",\n",
    "        },\n",
    "    },\n",
    "    {\n",
    "        \"person_id\": \"8732762874\",\n",
    "        \"firstname\": \"Toni\",\n",
    "        \"lastname\": \"Jones\",\n",
    "        \"dateofbirth\": datetime(1991, 11, 23, 16, 53, 56),\n",
    "        \"vocation\": \"POLITICIAN\",\n",
    "        \"address\": {\n",
    "            \"number\": 1,\n",
    "            \"street\": \"High Street\",\n",
    "            \"city\": \"Upper Abbeywoodington\",\n",
    "        },\n",
    "    },\n",
    "    {\n",
    "        \"person_id\": \"7363629563\",\n",
    "        \"firstname\": \"Bert\",\n",
    "        \"lastname\": \"Gooding\",\n",
    "        \"dateofbirth\": datetime(1941, 4, 7, 22, 11, 52),\n",
    "        \"vocation\": \"FLORIST\",\n",
    "        \"address\": {\n",
    "            \"number\": 13,\n",
    "            \"street\": \"Upper Bold Road\",\n",
    "            \"city\": \"Redringtonville\",\n",
    "        },\n",
    "    },\n",
    "    {\n",
    "        \"person_id\": \"1029648329\",\n",
    "        \"firstname\": \"Sophie\",\n",
    "        \"lastname\": \"Celements\",\n",
    "        \"dateofbirth\": datetime(1959, 7, 6, 17, 35, 45),\n",
    "        \"vocation\": \"ENGINEER\",\n",
    "        \"address\": {\n",
    "            \"number\": 5,\n",
    "            \"street\": \"Innings Close\",\n",
    "            \"city\": \"Basilbridge\",\n",
    "        },\n",
    "    },\n",
    "    {\n",
    "        \"person_id\": \"7363626383\",\n",
    "        \"firstname\": \"Carl\",\n",
    "        \"lastname\": \"Simmons\",\n",
    "        \"dateofbirth\": datetime(1998, 12, 26, 13, 13, 55),\n",
    "        \"vocation\": \"ENGINEER\",\n",
    "        \"address\": {\n",
    "            \"number\": 187,\n",
    "            \"street\": \"Hillside Road\",\n",
    "            \"city\": \"Kenningford\",\n",
    "        },\n",
    "    },\n",
    "]\n",
    "\n",
    "person_coll.insert_many(person_data)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9d31c00c",
   "metadata": {},
   "source": [
    "### Simple Match"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "15c7a258-410e-4f66-9723-653f4f700402",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'_id': ObjectId('69d01fefc8f9ecfbbec7707d'),\n",
       "  'person_id': '6392529400',\n",
       "  'firstname': 'Elise',\n",
       "  'lastname': 'Smith',\n",
       "  'dateofbirth': datetime.datetime(1972, 1, 13, 9, 32, 7),\n",
       "  'vocation': 'ENGINEER',\n",
       "  'address': {'number': 5625, 'street': 'Tipa Circle', 'city': 'Wojzinmoj'}},\n",
       " {'_id': ObjectId('69d01fefc8f9ecfbbec7707e'),\n",
       "  'person_id': '1723338115',\n",
       "  'firstname': 'Olive',\n",
       "  'lastname': 'Ranieri',\n",
       "  'dateofbirth': datetime.datetime(1985, 5, 12, 23, 14, 30),\n",
       "  'gender': 'FEMALE',\n",
       "  'vocation': 'ENGINEER',\n",
       "  'address': {'number': 9303, 'street': 'Mele Circle', 'city': 'Tobihbo'}},\n",
       " {'_id': ObjectId('69d01fefc8f9ecfbbec77081'),\n",
       "  'person_id': '1029648329',\n",
       "  'firstname': 'Sophie',\n",
       "  'lastname': 'Celements',\n",
       "  'dateofbirth': datetime.datetime(1959, 7, 6, 17, 35, 45),\n",
       "  'vocation': 'ENGINEER',\n",
       "  'address': {'number': 5, 'street': 'Innings Close', 'city': 'Basilbridge'}},\n",
       " {'_id': ObjectId('69d01fefc8f9ecfbbec77082'),\n",
       "  'person_id': '7363626383',\n",
       "  'firstname': 'Carl',\n",
       "  'lastname': 'Simmons',\n",
       "  'dateofbirth': datetime.datetime(1998, 12, 26, 13, 13, 55),\n",
       "  'vocation': 'ENGINEER',\n",
       "  'address': {'number': 187,\n",
       "   'street': 'Hillside Road',\n",
       "   'city': 'Kenningford'}}]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# I want to find all the people with vocation = \"Engineer\"\n",
    "#\n",
    "#\n",
    "query = {\"vocation\": \"ENGINEER\"}\n",
    "result = person_coll.find(filter=query)\n",
    "list(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "7a80c1a6-5fe4-4a3d-a009-d4b9a9270150",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'firstname': 'Elise', 'lastname': 'Smith', 'vocation': 'ENGINEER'},\n",
       " {'firstname': 'Olive', 'lastname': 'Ranieri', 'vocation': 'ENGINEER'},\n",
       " {'firstname': 'Sophie', 'lastname': 'Celements', 'vocation': 'ENGINEER'},\n",
       " {'firstname': 'Carl', 'lastname': 'Simmons', 'vocation': 'ENGINEER'}]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# If I only want a subset of the properties, I can also use projection.\n",
    "#\n",
    "query = {\"vocation\": \"ENGINEER\"}\n",
    "projection = {\n",
    "    \"firstname\" : 1,\n",
    "    \"lastname\": 1,\n",
    "    \"vocation\": 1,\n",
    "    \"_id\": 0\n",
    "}\n",
    "result = person_coll.find(filter=query, projection=projection)\n",
    "list(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ae706f84-68d4-4544-9ffe-9da129afff07",
   "metadata": {},
   "source": [
    "### Match"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9a4de97e-cb76-4475-9e1a-0d5ef951b9ac",
   "metadata": {},
   "source": [
    "I use \"$match\" operation is I want to \"find\" documents in a stage in a pipeline."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "483df174",
   "metadata": {},
   "outputs": [],
   "source": [
    "pipeline = []\n",
    "pipeline.append({\"$match\": {\"vocation\": \"ENGINEER\"}})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "fb268daf-1a91-4b09-b9ab-6993bb76897e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'$match': {'vocation': 'ENGINEER'}}]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pipeline"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "12250275",
   "metadata": {},
   "outputs": [],
   "source": [
    "result = person_coll.aggregate(pipeline)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "a5b509d5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'_id': ObjectId('69d01fefc8f9ecfbbec7707d'),\n",
       "  'person_id': '6392529400',\n",
       "  'firstname': 'Elise',\n",
       "  'lastname': 'Smith',\n",
       "  'dateofbirth': datetime.datetime(1972, 1, 13, 9, 32, 7),\n",
       "  'vocation': 'ENGINEER',\n",
       "  'address': {'number': 5625, 'street': 'Tipa Circle', 'city': 'Wojzinmoj'}},\n",
       " {'_id': ObjectId('69d01fefc8f9ecfbbec7707e'),\n",
       "  'person_id': '1723338115',\n",
       "  'firstname': 'Olive',\n",
       "  'lastname': 'Ranieri',\n",
       "  'dateofbirth': datetime.datetime(1985, 5, 12, 23, 14, 30),\n",
       "  'gender': 'FEMALE',\n",
       "  'vocation': 'ENGINEER',\n",
       "  'address': {'number': 9303, 'street': 'Mele Circle', 'city': 'Tobihbo'}},\n",
       " {'_id': ObjectId('69d01fefc8f9ecfbbec77081'),\n",
       "  'person_id': '1029648329',\n",
       "  'firstname': 'Sophie',\n",
       "  'lastname': 'Celements',\n",
       "  'dateofbirth': datetime.datetime(1959, 7, 6, 17, 35, 45),\n",
       "  'vocation': 'ENGINEER',\n",
       "  'address': {'number': 5, 'street': 'Innings Close', 'city': 'Basilbridge'}},\n",
       " {'_id': ObjectId('69d01fefc8f9ecfbbec77082'),\n",
       "  'person_id': '7363626383',\n",
       "  'firstname': 'Carl',\n",
       "  'lastname': 'Simmons',\n",
       "  'dateofbirth': datetime.datetime(1998, 12, 26, 13, 13, 55),\n",
       "  'vocation': 'ENGINEER',\n",
       "  'address': {'number': 187,\n",
       "   'street': 'Hillside Road',\n",
       "   'city': 'Kenningford'}}]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "list(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "c5f924c5-f75c-458f-8481-a5c4932eb89a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'$match': {'vocation': 'ENGINEER'}},\n",
       " {'$project': {'firstname': 1, 'lastname': 1, 'vocation': 1, '_id': 0}},\n",
       " {'$project': {'firstname': 1, 'lastname': 1, 'vocation': 1, '_id': 0}}]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#\n",
    "# I can also project within a pipeline\n",
    "#\n",
    "pipeline.append({\n",
    "    \"$project\": {\n",
    "        \"firstname\": 1,\n",
    "        \"lastname\": 1,\n",
    "        \"vocation\" : 1,\n",
    "        \"_id\": 0\n",
    "    }\n",
    "})\n",
    "pipeline"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "552e7623-7cb7-4df3-89f8-1e972fb762d1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'firstname': 'Elise', 'lastname': 'Smith', 'vocation': 'ENGINEER'},\n",
       " {'firstname': 'Olive', 'lastname': 'Ranieri', 'vocation': 'ENGINEER'},\n",
       " {'firstname': 'Sophie', 'lastname': 'Celements', 'vocation': 'ENGINEER'},\n",
       " {'firstname': 'Carl', 'lastname': 'Simmons', 'vocation': 'ENGINEER'}]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result = person_coll.aggregate(pipeline)\n",
    "list(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4db58f03-9af0-4b2e-9fea-879cf69713ac",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "9e33d880",
   "metadata": {},
   "source": [
    "## Add Some Additional Stages"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "fee054a2-d8c8-4118-b425-7bca7aedc702",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'$match': {'vocation': 'ENGINEER'}},\n",
       " {'$sort': {'dateofbirth': -1}},\n",
       " {'$limit': 3},\n",
       " {'$unset': ['_id', 'address']}]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pipeline = []\n",
    "pipeline.append({\"$match\": {\"vocation\": \"ENGINEER\"}})\n",
    "pipeline.append({\"$sort\": {\"dateofbirth\": -1}})\n",
    "pipeline.append({\"$limit\": 3})\n",
    "pipeline.append({\"$unset\": [\"_id\", \"address\"]})\n",
    "pipeline"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "c7f797ab",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'person_id': '7363626383',\n",
       "  'firstname': 'Carl',\n",
       "  'lastname': 'Simmons',\n",
       "  'dateofbirth': datetime.datetime(1998, 12, 26, 13, 13, 55),\n",
       "  'vocation': 'ENGINEER'},\n",
       " {'person_id': '1723338115',\n",
       "  'firstname': 'Olive',\n",
       "  'lastname': 'Ranieri',\n",
       "  'dateofbirth': datetime.datetime(1985, 5, 12, 23, 14, 30),\n",
       "  'gender': 'FEMALE',\n",
       "  'vocation': 'ENGINEER'},\n",
       " {'person_id': '6392529400',\n",
       "  'firstname': 'Elise',\n",
       "  'lastname': 'Smith',\n",
       "  'dateofbirth': datetime.datetime(1972, 1, 13, 9, 32, 7),\n",
       "  'vocation': 'ENGINEER'}]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# pipeline.append({\"$project\": {\"firstname\": 1}})\n",
    "result = person_coll.aggregate(pipeline)\n",
    "list(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "26192279-d20f-4fff-b24c-54c076f3010e",
   "metadata": {},
   "source": [
    "### Group and Total Data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "f7de564f-be8c-413f-9bdc-9f5f4e900363",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "InsertManyResult([ObjectId('69d0227fc8f9ecfbbec77087'), ObjectId('69d0227fc8f9ecfbbec77088'), ObjectId('69d0227fc8f9ecfbbec77089'), ObjectId('69d0227fc8f9ecfbbec7708a')], acknowledged=True)"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#\n",
    "# Create the data\n",
    "#\n",
    "orders_coll = agg_db[\"orders\"]\n",
    "products_coll = agg_db[\"products\"]\n",
    "\n",
    "order_data = [\n",
    "    {\n",
    "        \"customer_id\": \"elise_smith@myemail.com\",\n",
    "        \"orderdate\": datetime(2020, 5, 30, 8, 35, 52),\n",
    "        \"product_id\": \"a1b2c3d4\",\n",
    "        \"value\": 431.43,\n",
    "    },\n",
    "    {\n",
    "        \"customer_id\": \"tj@wheresmyemail.com\",\n",
    "        \"orderdate\": datetime(2019, 5, 28, 19, 13, 32),\n",
    "        \"product_id\": \"z9y8x7w6\",\n",
    "        \"value\": 5.01,\n",
    "    },\n",
    "    {\n",
    "        \"customer_id\": \"oranieri@warmmail.com\",\n",
    "        \"orderdate\": datetime(2020, 1, 1, 8, 25, 37),\n",
    "        \"product_id\": \"ff11gg22hh33\",\n",
    "        \"value\": 63.13,\n",
    "    },\n",
    "    {\n",
    "        \"customer_id\": \"jjones@tepidmail.com\",\n",
    "        \"orderdate\": datetime(2020, 12, 26, 8, 55, 46),\n",
    "        \"product_id\": \"a1b2c3d4\",\n",
    "        \"value\": 429.65,\n",
    "    },\n",
    "]\n",
    "\n",
    "orders_coll.insert_many(order_data)\n",
    "\n",
    "product_data = [\n",
    "    {\n",
    "        \"id\": \"a1b2c3d4\",\n",
    "        \"name\": \"Asus Laptop\",\n",
    "        \"category\": \"ELECTRONICS\",\n",
    "        \"description\": \"Good value laptop for students\",\n",
    "    },\n",
    "    {\n",
    "        \"id\": \"z9y8x7w6\",\n",
    "        \"name\": \"The Day Of The Triffids\",\n",
    "        \"category\": \"BOOKS\",\n",
    "        \"description\": \"Classic post-apocalyptic novel\",\n",
    "    },\n",
    "    {\n",
    "        \"id\": \"ff11gg22hh33\",\n",
    "        \"name\": \"Morphy Richardds Food Mixer\",\n",
    "        \"category\": \"KITCHENWARE\",\n",
    "        \"description\": \"Luxury mixer turning good cakes into great\",\n",
    "    },\n",
    "    {\n",
    "        \"id\": \"pqr678st\",\n",
    "        \"name\": \"Karcher Hose Set\",\n",
    "        \"category\": \"GARDEN\",\n",
    "        \"description\": \"Hose + nozzles + winder for tidy storage\",\n",
    "    },\n",
    "]\n",
    "\n",
    "products_coll.insert_many(product_data)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "97193ef3-d1d2-44c2-9187-3fd62f7451e4",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "76b068f8-432f-4688-8855-d892a64352e0",
   "metadata": {},
   "source": [
    "### Unwind Arrays and Group Data"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c0945429-56d1-4307-aed9-50bfda12ce82",
   "metadata": {},
   "source": [
    "### Perform One-to-One Joins"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c7eaa5ed-fc54-471f-bb26-58fabdc5f5c3",
   "metadata": {},
   "source": [
    "# Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "c5b3d2e3-cfe3-4672-ab91-3af9f3fe493b",
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "# %pip install neo4j\n",
    "import neo4j\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "72f448b8-1c6d-4213-aabd-17babad87fb5",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Wait 60 seconds before connecting using these details, or login to https://console.neo4j.io to validate the Aura Instance is available\n",
    "NEO4J_URI=\"neo4j+ssc://c4fe1614.databases.neo4j.io\"\n",
    "NEO4J_USERNAME=\"c4fe1614\"\n",
    "NEO4J_PASSWORD=\"z2eolm_3MEkwYvicfs23Aotp3FacvYCkYw9wzkaBxOk\"\n",
    "NEO4J_DATABASE=\"c4fe1614\"\n",
    "AURA_INSTANCEID=\"c4fe1614\"\n",
    "AURA_INSTANCENAME=\"Instance01\"\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "146d7b56-77d8-4061-ac9c-01f3d1e82378",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "# URI examples: \"neo4j://localhost\", \"neo4j+s://xxx.databases.neo4j.io\"\n",
    "\n",
    "URL = NEO4J_URI\n",
    "\n",
    "AUTH = (NEO4J_USERNAME, NEO4J_PASSWORD)\n",
    "\n",
    "\n",
    "\n",
    "with GraphDatabase.driver(NEO4J_URI, auth=AUTH) as driver:\n",
    "    driver.verify_connectivity()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "03b644d2-b18b-4c15-acd2-35ea273884aa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'name': 'Paul Blythe'}\n",
      "{'name': 'Angela Scope'}\n",
      "{'name': 'James Thompson'}\n",
      "The query `\n",
      "    MATCH (p:Person)-[:FOLLOWS]->(:Person)\n",
      "    RETURN p.name AS name\n",
      "    ` returned 3 records in 23 ms.\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "# URI examples: \"neo4j://localhost\", \"neo4j+s://xxx.databases.neo4j.io\"\n",
    "\n",
    "URL = NEO4J_URI\n",
    "\n",
    "AUTH = (NEO4J_USERNAME, NEO4J_PASSWORD)\n",
    "\n",
    "\n",
    "\n",
    "with GraphDatabase.driver(NEO4J_URI, auth=AUTH) as driver:\n",
    "    driver.verify_connectivity()\n",
    "\n",
    "    records, summary, keys = driver.execute_query(\"\"\"\n",
    "    MATCH (p:Person)-[:FOLLOWS]->(:Person)\n",
    "    RETURN p.name AS name\n",
    "    \"\"\",\n",
    "    database_=NEO4J_DATABASE,\n",
    ")\n",
    "\n",
    "# Loop through results and do something with them\n",
    "for record in records:\n",
    "    print(record.data())  # obtain record as dict\n",
    "\n",
    "# Summary information\n",
    "print(\"The query `{query}` returned {records_count} records in {time} ms.\".format(\n",
    "    query=summary.query, records_count=len(records),\n",
    "    time=summary.result_available_after\n",
    "))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "cffa6aff-737b-4a67-b78b-740473e724f3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'p': {'born': 1956, 'name': 'Tom Hanks'}}\n",
      "The query `\n",
      "        MATCH (p:Person {name: \"Tom Hanks\"})\n",
      "        RETURN p\n",
      "    ` returned 1 records in 19 ms.\n"
     ]
    }
   ],
   "source": [
    "with GraphDatabase.driver(NEO4J_URI, auth=AUTH) as driver:\n",
    "    driver.verify_connectivity()\n",
    "\n",
    "    records, summary, keys = driver.execute_query(\"\"\"\n",
    "        MATCH (p:Person {name: \"Tom Hanks\"})\n",
    "        RETURN p\n",
    "    \"\"\",\n",
    "    database_=NEO4J_DATABASE,\n",
    ")\n",
    "\n",
    "# Loop through results and do something with them\n",
    "for record in records:\n",
    "    print(record.data())  # obtain record as dict\n",
    "\n",
    "# Summary information\n",
    "print(\"The query `{query}` returned {records_count} records in {time} ms.\".format(\n",
    "    query=summary.query, records_count=len(records),\n",
    "    time=summary.result_available_after\n",
    "))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "6792cfda-031c-401f-b6e7-e3e6ac449531",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'p': {'born': 1956, 'name': 'Tom Hanks'}, 'r': ({'born': 1956, 'name': 'Tom Hanks'}, 'DIRECTED', {'tagline': 'In every life there comes a time when that thing you dream becomes that thing you do', 'title': 'That Thing You Do', 'released': 1996}), 'm': {'tagline': 'In every life there comes a time when that thing you dream becomes that thing you do', 'title': 'That Thing You Do', 'released': 1996}}\n",
      "The query `\n",
      "        MATCH (p:Person {name: \"Tom Hanks\"})-[r:DIRECTED]->(m)\n",
      "        RETURN p,r,m\n",
      "    ` returned 1 records in 24 ms.\n"
     ]
    }
   ],
   "source": [
    "with GraphDatabase.driver(NEO4J_URI, auth=AUTH) as driver:\n",
    "    driver.verify_connectivity()\n",
    "\n",
    "    records, summary, keys = driver.execute_query(\"\"\"\n",
    "        MATCH (p:Person {name: \"Tom Hanks\"})-[r:DIRECTED]->(m)\n",
    "        RETURN p,r,m\n",
    "    \"\"\",\n",
    "    database_=NEO4J_DATABASE,\n",
    ")\n",
    "\n",
    "# Loop through results and do something with them\n",
    "for record in records:\n",
    "    print(record.data())  # obtain record as dict\n",
    "\n",
    "# Summary information\n",
    "print(\"The query `{query}` returned {records_count} records in {time} ms.\".format(\n",
    "    query=summary.query, records_count=len(records),\n",
    "    time=summary.result_available_after\n",
    "))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "416e9193-f4b4-4ab3-9f82-49a3741ff2cb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'m.title': \"You've Got Mail\", 'p2.name': 'Meg Ryan'}\n",
      "{'m.title': \"You've Got Mail\", 'p2.name': 'Greg Kinnear'}\n",
      "{'m.title': \"You've Got Mail\", 'p2.name': 'Parker Posey'}\n",
      "{'m.title': \"You've Got Mail\", 'p2.name': 'Dave Chappelle'}\n",
      "{'m.title': \"You've Got Mail\", 'p2.name': 'Steve Zahn'}\n",
      "{'m.title': 'Sleepless in Seattle', 'p2.name': 'Meg Ryan'}\n",
      "{'m.title': 'Sleepless in Seattle', 'p2.name': 'Rita Wilson'}\n",
      "{'m.title': 'Sleepless in Seattle', 'p2.name': 'Bill Pullman'}\n",
      "{'m.title': 'Sleepless in Seattle', 'p2.name': 'Victor Garber'}\n",
      "{'m.title': 'Sleepless in Seattle', 'p2.name': \"Rosie O'Donnell\"}\n",
      "{'m.title': 'Joe Versus the Volcano', 'p2.name': 'Meg Ryan'}\n",
      "{'m.title': 'Joe Versus the Volcano', 'p2.name': 'Nathan Lane'}\n",
      "{'m.title': 'That Thing You Do', 'p2.name': 'Charlize Theron'}\n",
      "{'m.title': 'That Thing You Do', 'p2.name': 'Liv Tyler'}\n",
      "{'m.title': 'Cloud Atlas', 'p2.name': 'Hugo Weaving'}\n",
      "{'m.title': 'Cloud Atlas', 'p2.name': 'Halle Berry'}\n",
      "{'m.title': 'Cloud Atlas', 'p2.name': 'Jim Broadbent'}\n",
      "{'m.title': 'The Da Vinci Code', 'p2.name': 'Ian McKellen'}\n",
      "{'m.title': 'The Da Vinci Code', 'p2.name': 'Audrey Tautou'}\n",
      "{'m.title': 'The Da Vinci Code', 'p2.name': 'Paul Bettany'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'Bonnie Hunt'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'James Cromwell'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'Michael Clarke Duncan'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'David Morse'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'Sam Rockwell'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'Gary Sinise'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'Patricia Clarkson'}\n",
      "{'m.title': 'Apollo 13', 'p2.name': 'Kevin Bacon'}\n",
      "{'m.title': 'Apollo 13', 'p2.name': 'Gary Sinise'}\n",
      "{'m.title': 'Apollo 13', 'p2.name': 'Ed Harris'}\n",
      "{'m.title': 'Apollo 13', 'p2.name': 'Bill Paxton'}\n",
      "{'m.title': 'Cast Away', 'p2.name': 'Helen Hunt'}\n",
      "{'m.title': \"Charlie Wilson's War\", 'p2.name': 'Philip Seymour Hoffman'}\n",
      "{'m.title': \"Charlie Wilson's War\", 'p2.name': 'Julia Roberts'}\n",
      "{'m.title': 'A League of Their Own', 'p2.name': \"Rosie O'Donnell\"}\n",
      "{'m.title': 'A League of Their Own', 'p2.name': 'Bill Paxton'}\n",
      "{'m.title': 'A League of Their Own', 'p2.name': 'Madonna'}\n",
      "{'m.title': 'A League of Their Own', 'p2.name': 'Geena Davis'}\n",
      "{'m.title': 'A League of Their Own', 'p2.name': 'Lori Petty'}\n",
      "The query `\n",
      "        MATCH (p:Person {name: \"Tom Hanks\"})-[r:ACTED_IN]->(m)<-[:ACTED_IN]-(p2)\n",
      "        RETURN m.title, p2.name\n",
      "    ` returned 39 records in 1 ms.\n"
     ]
    }
   ],
   "source": [
    "with GraphDatabase.driver(NEO4J_URI, auth=AUTH) as driver:\n",
    "    driver.verify_connectivity()\n",
    "\n",
    "    records, summary, keys = driver.execute_query(\"\"\"\n",
    "        MATCH (p:Person {name: \"Tom Hanks\"})-[r:ACTED_IN]->(m)<-[:ACTED_IN]-(p2)\n",
    "        RETURN m.title, p2.name\n",
    "    \"\"\",\n",
    "    database_=NEO4J_DATABASE,\n",
    ")\n",
    "\n",
    "# Loop through results and do something with them\n",
    "for record in records:\n",
    "    print(record.data())  # obtain record as dict\n",
    "\n",
    "# Summary information\n",
    "print(\"The query `{query}` returned {records_count} records in {time} ms.\".format(\n",
    "    query=summary.query, records_count=len(records),\n",
    "    time=summary.result_available_after\n",
    "))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "b2a10586-379a-4e58-b211-249a7b27c508",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'m.title': \"You've Got Mail\", 'p2.name': 'Meg Ryan'}\n",
      "{'m.title': \"You've Got Mail\", 'p2.name': 'Greg Kinnear'}\n",
      "{'m.title': \"You've Got Mail\", 'p2.name': 'Parker Posey'}\n",
      "{'m.title': \"You've Got Mail\", 'p2.name': 'Dave Chappelle'}\n",
      "{'m.title': \"You've Got Mail\", 'p2.name': 'Steve Zahn'}\n",
      "{'m.title': 'Sleepless in Seattle', 'p2.name': 'Meg Ryan'}\n",
      "{'m.title': 'Sleepless in Seattle', 'p2.name': 'Rita Wilson'}\n",
      "{'m.title': 'Sleepless in Seattle', 'p2.name': 'Bill Pullman'}\n",
      "{'m.title': 'Sleepless in Seattle', 'p2.name': 'Victor Garber'}\n",
      "{'m.title': 'Sleepless in Seattle', 'p2.name': \"Rosie O'Donnell\"}\n",
      "{'m.title': 'Joe Versus the Volcano', 'p2.name': 'Meg Ryan'}\n",
      "{'m.title': 'Joe Versus the Volcano', 'p2.name': 'Nathan Lane'}\n",
      "{'m.title': 'That Thing You Do', 'p2.name': 'Charlize Theron'}\n",
      "{'m.title': 'That Thing You Do', 'p2.name': 'Liv Tyler'}\n",
      "{'m.title': 'Cloud Atlas', 'p2.name': 'Hugo Weaving'}\n",
      "{'m.title': 'Cloud Atlas', 'p2.name': 'Halle Berry'}\n",
      "{'m.title': 'Cloud Atlas', 'p2.name': 'Jim Broadbent'}\n",
      "{'m.title': 'The Da Vinci Code', 'p2.name': 'Ian McKellen'}\n",
      "{'m.title': 'The Da Vinci Code', 'p2.name': 'Audrey Tautou'}\n",
      "{'m.title': 'The Da Vinci Code', 'p2.name': 'Paul Bettany'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'Bonnie Hunt'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'James Cromwell'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'Michael Clarke Duncan'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'David Morse'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'Sam Rockwell'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'Gary Sinise'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'Patricia Clarkson'}\n",
      "{'m.title': 'Apollo 13', 'p2.name': 'Kevin Bacon'}\n",
      "{'m.title': 'Apollo 13', 'p2.name': 'Gary Sinise'}\n",
      "{'m.title': 'Apollo 13', 'p2.name': 'Ed Harris'}\n",
      "{'m.title': 'Apollo 13', 'p2.name': 'Bill Paxton'}\n",
      "{'m.title': 'Cast Away', 'p2.name': 'Helen Hunt'}\n",
      "{'m.title': \"Charlie Wilson's War\", 'p2.name': 'Philip Seymour Hoffman'}\n",
      "{'m.title': \"Charlie Wilson's War\", 'p2.name': 'Julia Roberts'}\n",
      "{'m.title': 'A League of Their Own', 'p2.name': \"Rosie O'Donnell\"}\n",
      "{'m.title': 'A League of Their Own', 'p2.name': 'Bill Paxton'}\n",
      "{'m.title': 'A League of Their Own', 'p2.name': 'Madonna'}\n",
      "{'m.title': 'A League of Their Own', 'p2.name': 'Geena Davis'}\n",
      "{'m.title': 'A League of Their Own', 'p2.name': 'Lori Petty'}\n",
      "The query `\n",
      "        MATCH (p:Person {name: \"Tom Hanks\"})-[r:ACTED_IN]->(m)<-[:ACTED_IN]-(p2)\n",
      "        RETURN m.title, p2.name\n",
      "    ` returned 39 records in 1 ms.\n"
     ]
    }
   ],
   "source": [
    "with GraphDatabase.driver(NEO4J_URI, auth=AUTH) as driver:\n",
    "    driver.verify_connectivity()\n",
    "\n",
    "    records, summary, keys = driver.execute_query(\"\"\"\n",
    "        MATCH (p:Person {name: \"Tom Hanks\"})-[r:ACTED_IN]->(m)<-[:ACTED_IN]-(p2)\n",
    "        RETURN m.title, p2.name\n",
    "    \"\"\",\n",
    "    database_=NEO4J_DATABASE,\n",
    ")\n",
    "\n",
    "# Loop through results and do something with them\n",
    "for record in records:\n",
    "    print(record.data())  # obtain record as dict\n",
    "\n",
    "# Summary information\n",
    "print(\"The query `{query}` returned {records_count} records in {time} ms.\".format(\n",
    "    query=summary.query, records_count=len(records),\n",
    "    time=summary.result_available_after\n",
    "))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6856def4-2e4c-4340-b3c4-76832f612fa5",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
