{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "c5b3d2e3-cfe3-4672-ab91-3af9f3fe493b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Collecting neo4j\n",
      "  Downloading neo4j-6.1.0-py3-none-any.whl.metadata (5.3 kB)\n",
      "Collecting pytz (from neo4j)\n",
      "  Downloading pytz-2026.1.post1-py2.py3-none-any.whl.metadata (22 kB)\n",
      "Downloading neo4j-6.1.0-py3-none-any.whl (325 kB)\n",
      "Downloading pytz-2026.1.post1-py2.py3-none-any.whl (510 kB)\n",
      "Installing collected packages: pytz, neo4j\n",
      "\u001b[2K   \u001b[38;2;114;156;31m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m2/2\u001b[0m [neo4j]━━━━━\u001b[0m \u001b[32m1/2\u001b[0m [neo4j]\n",
      "\u001b[1A\u001b[2KSuccessfully installed neo4j-6.1.0 pytz-2026.1.post1\n",
      "\n",
      "\u001b[1m[\u001b[0m\u001b[34;49mnotice\u001b[0m\u001b[1;39;49m]\u001b[0m\u001b[39;49m A new release of pip is available: \u001b[0m\u001b[31;49m25.3\u001b[0m\u001b[39;49m -> \u001b[0m\u001b[32;49m26.0.1\u001b[0m\n",
      "\u001b[1m[\u001b[0m\u001b[34;49mnotice\u001b[0m\u001b[1;39;49m]\u001b[0m\u001b[39;49m To update, run: \u001b[0m\u001b[32;49mpip3 install --upgrade pip\u001b[0m\n",
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    }
   ],
   "source": [
    "%pip install neo4j\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "20008358-80d4-41b2-b36f-81b446dc7567",
   "metadata": {},
   "outputs": [],
   "source": [
    "NEO4J_URI=\"neo4j+ssc://15ed6c28.databases.neo4j.io\"\n",
    "NEO4J_USERNAME=\"15ed6c28\"\n",
    "NEO4J_PASSWORD=\"IllFSBhDximX2vVRGWTjeeADZIBWAmiWKKZuW94ZvRs\"\n",
    "NEO4J_DATABASE=\"15ed6c28\"\n",
    "AURA_INSTANCEID=\"15ed6c28\"\n",
    "AURA_INSTANCENAME=\"Instance02\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "146d7b56-77d8-4061-ac9c-01f3d1e82378",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "# URI examples: \"neo4j://localhost\", \"neo4j+s://xxx.databases.neo4j.io\"\n",
    "\n",
    "URL = NEO4J_URI\n",
    "\n",
    "AUTH = (NEO4J_USERNAME, NEO4J_PASSWORD)\n",
    "\n",
    "\n",
    "\n",
    "with GraphDatabase.driver(NEO4J_URI, auth=AUTH) as driver:\n",
    "    driver.verify_connectivity()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "03b644d2-b18b-4c15-acd2-35ea273884aa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'name': 'Paul Blythe'}\n",
      "{'name': 'Angela Scope'}\n",
      "{'name': 'James Thompson'}\n",
      "The query `\n",
      "    MATCH (p:Person)-[:FOLLOWS]->(:Person)\n",
      "    RETURN p.name AS name\n",
      "    ` returned 3 records in 18 ms.\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "# URI examples: \"neo4j://localhost\", \"neo4j+s://xxx.databases.neo4j.io\"\n",
    "\n",
    "URL = NEO4J_URI\n",
    "\n",
    "AUTH = (NEO4J_USERNAME, NEO4J_PASSWORD)\n",
    "\n",
    "\n",
    "\n",
    "with GraphDatabase.driver(NEO4J_URI, auth=AUTH) as driver:\n",
    "    driver.verify_connectivity()\n",
    "\n",
    "    records, summary, keys = driver.execute_query(\"\"\"\n",
    "    MATCH (p:Person)-[:FOLLOWS]->(:Person)\n",
    "    RETURN p.name AS name\n",
    "    \"\"\",\n",
    "    database_=NEO4J_DATABASE,\n",
    ")\n",
    "\n",
    "# Loop through results and do something with them\n",
    "for record in records:\n",
    "    print(record.data())  # obtain record as dict\n",
    "\n",
    "# Summary information\n",
    "print(\"The query `{query}` returned {records_count} records in {time} ms.\".format(\n",
    "    query=summary.query, records_count=len(records),\n",
    "    time=summary.result_available_after\n",
    "))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "cffa6aff-737b-4a67-b78b-740473e724f3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'p': {'born': 1956, 'name': 'Tom Hanks'}}\n",
      "The query `\n",
      "        MATCH (p:Person {name: \"Tom Hanks\"})\n",
      "        RETURN p\n",
      "    ` returned 1 records in 15 ms.\n"
     ]
    }
   ],
   "source": [
    "with GraphDatabase.driver(NEO4J_URI, auth=AUTH) as driver:\n",
    "    driver.verify_connectivity()\n",
    "\n",
    "    records, summary, keys = driver.execute_query(\"\"\"\n",
    "        MATCH (p:Person {name: \"Tom Hanks\"})\n",
    "        RETURN p\n",
    "    \"\"\",\n",
    "    database_=NEO4J_DATABASE,\n",
    ")\n",
    "\n",
    "# Loop through results and do something with them\n",
    "for record in records:\n",
    "    print(record.data())  # obtain record as dict\n",
    "\n",
    "# Summary information\n",
    "print(\"The query `{query}` returned {records_count} records in {time} ms.\".format(\n",
    "    query=summary.query, records_count=len(records),\n",
    "    time=summary.result_available_after\n",
    "))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "6792cfda-031c-401f-b6e7-e3e6ac449531",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'p': {'born': 1956, 'name': 'Tom Hanks'}, 'r': ({'born': 1956, 'name': 'Tom Hanks'}, 'DIRECTED', {'tagline': 'In every life there comes a time when that thing you dream becomes that thing you do', 'title': 'That Thing You Do', 'released': 1996}), 'm': {'tagline': 'In every life there comes a time when that thing you dream becomes that thing you do', 'title': 'That Thing You Do', 'released': 1996}}\n",
      "The query `\n",
      "        MATCH (p:Person {name: \"Tom Hanks\"})-[r:DIRECTED]->(m)\n",
      "        RETURN p,r,m\n",
      "    ` returned 1 records in 22 ms.\n"
     ]
    }
   ],
   "source": [
    "with GraphDatabase.driver(NEO4J_URI, auth=AUTH) as driver:\n",
    "    driver.verify_connectivity()\n",
    "\n",
    "    records, summary, keys = driver.execute_query(\"\"\"\n",
    "        MATCH (p:Person {name: \"Tom Hanks\"})-[r:DIRECTED]->(m)\n",
    "        RETURN p,r,m\n",
    "    \"\"\",\n",
    "    database_=NEO4J_DATABASE,\n",
    ")\n",
    "\n",
    "# Loop through results and do something with them\n",
    "for record in records:\n",
    "    print(record.data())  # obtain record as dict\n",
    "\n",
    "# Summary information\n",
    "print(\"The query `{query}` returned {records_count} records in {time} ms.\".format(\n",
    "    query=summary.query, records_count=len(records),\n",
    "    time=summary.result_available_after\n",
    "))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "d0881b5a-024f-429f-b53c-c511e0d31416",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record p=<Node element_id='4:dd4da19a-ea8c-4280-b9fa-99492d0554c0:68' labels=frozenset({'Person'}) properties={'born': 1956, 'name': 'Tom Hanks'}> r=<Relationship element_id='5:dd4da19a-ea8c-4280-b9fa-99492d0554c0:6917530127152709717' nodes=(<Node element_id='4:dd4da19a-ea8c-4280-b9fa-99492d0554c0:68' labels=frozenset({'Person'}) properties={'born': 1956, 'name': 'Tom Hanks'}>, <Node element_id='4:dd4da19a-ea8c-4280-b9fa-99492d0554c0:85' labels=frozenset({'Movie'}) properties={'tagline': 'In every life there comes a time when that thing you dream becomes that thing you do', 'title': 'That Thing You Do', 'released': 1996}>) type='DIRECTED' properties={}> m=<Node element_id='4:dd4da19a-ea8c-4280-b9fa-99492d0554c0:85' labels=frozenset({'Movie'}) properties={'tagline': 'In every life there comes a time when that thing you dream becomes that thing you do', 'title': 'That Thing You Do', 'released': 1996}>>]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "records"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "fe1e3ffd-dc2f-4e91-bf89-ffca2f8383b5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Record p=<Node element_id='4:dd4da19a-ea8c-4280-b9fa-99492d0554c0:68' labels=frozenset({'Person'}) properties={'born': 1956, 'name': 'Tom Hanks'}> r=<Relationship element_id='5:dd4da19a-ea8c-4280-b9fa-99492d0554c0:6917530127152709717' nodes=(<Node element_id='4:dd4da19a-ea8c-4280-b9fa-99492d0554c0:68' labels=frozenset({'Person'}) properties={'born': 1956, 'name': 'Tom Hanks'}>, <Node element_id='4:dd4da19a-ea8c-4280-b9fa-99492d0554c0:85' labels=frozenset({'Movie'}) properties={'tagline': 'In every life there comes a time when that thing you dream becomes that thing you do', 'title': 'That Thing You Do', 'released': 1996}>) type='DIRECTED' properties={}> m=<Node element_id='4:dd4da19a-ea8c-4280-b9fa-99492d0554c0:85' labels=frozenset({'Movie'}) properties={'tagline': 'In every life there comes a time when that thing you dream becomes that thing you do', 'title': 'That Thing You Do', 'released': 1996}>>"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "records[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "a71b3a1f-64e7-4e05-a53b-db53d503264e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "neo4j._data.Record"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "type(records[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "21b61bec-129e-4b40-afa1-cae8b882f0a3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['_Record__keys',\n",
       " '__abstractmethods__',\n",
       " '__add__',\n",
       " '__annotations__',\n",
       " '__class__',\n",
       " '__class_getitem__',\n",
       " '__contains__',\n",
       " '__delattr__',\n",
       " '__dict__',\n",
       " '__dir__',\n",
       " '__doc__',\n",
       " '__eq__',\n",
       " '__firstlineno__',\n",
       " '__format__',\n",
       " '__ge__',\n",
       " '__getattribute__',\n",
       " '__getitem__',\n",
       " '__getnewargs__',\n",
       " '__getstate__',\n",
       " '__gt__',\n",
       " '__hash__',\n",
       " '__init__',\n",
       " '__init_subclass__',\n",
       " '__iter__',\n",
       " '__le__',\n",
       " '__len__',\n",
       " '__lt__',\n",
       " '__module__',\n",
       " '__mul__',\n",
       " '__ne__',\n",
       " '__new__',\n",
       " '__reduce__',\n",
       " '__reduce_ex__',\n",
       " '__repr__',\n",
       " '__reversed__',\n",
       " '__rmul__',\n",
       " '__setattr__',\n",
       " '__sizeof__',\n",
       " '__slots__',\n",
       " '__static_attributes__',\n",
       " '__str__',\n",
       " '__subclasshook__',\n",
       " '_abc_impl',\n",
       " '_broken_record_error',\n",
       " '_super_getitem_single',\n",
       " 'count',\n",
       " 'data',\n",
       " 'get',\n",
       " 'index',\n",
       " 'items',\n",
       " 'keys',\n",
       " 'value',\n",
       " 'values']"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dir(records[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "15e8ab36-4bba-44af-a391-e6ad107f9df6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'p': {'born': 1956, 'name': 'Tom Hanks'},\n",
       " 'r': ({'born': 1956, 'name': 'Tom Hanks'},\n",
       "  'DIRECTED',\n",
       "  {'tagline': 'In every life there comes a time when that thing you dream becomes that thing you do',\n",
       "   'title': 'That Thing You Do',\n",
       "   'released': 1996}),\n",
       " 'm': {'tagline': 'In every life there comes a time when that thing you dream becomes that thing you do',\n",
       "  'title': 'That Thing You Do',\n",
       "  'released': 1996}}"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "records[0].data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "4f80162e-032d-4ddb-be53-0fdfed8a70e8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "dict"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "type(records[0].data())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "adbe5de3-cc71-43c1-9481-d1eb38b62ff9",
   "metadata": {},
   "outputs": [],
   "source": [
    "r=records[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "7e153a1d-df68-4dfb-b62a-bac8af1bf943",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['p', 'r', 'm']"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "r.keys()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "2217e556-5139-4048-96d7-432790d71703",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Node element_id='4:dd4da19a-ea8c-4280-b9fa-99492d0554c0:68' labels=frozenset({'Person'}) properties={'born': 1956, 'name': 'Tom Hanks'}>"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "r['p']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "6cca9aaa-9dab-4241-ac9b-8585a0477546",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['__abstractmethods__',\n",
       " '__class__',\n",
       " '__class_getitem__',\n",
       " '__contains__',\n",
       " '__delattr__',\n",
       " '__dict__',\n",
       " '__dir__',\n",
       " '__doc__',\n",
       " '__eq__',\n",
       " '__firstlineno__',\n",
       " '__format__',\n",
       " '__ge__',\n",
       " '__getattribute__',\n",
       " '__getitem__',\n",
       " '__getstate__',\n",
       " '__gt__',\n",
       " '__hash__',\n",
       " '__init__',\n",
       " '__init_subclass__',\n",
       " '__iter__',\n",
       " '__le__',\n",
       " '__len__',\n",
       " '__lt__',\n",
       " '__module__',\n",
       " '__ne__',\n",
       " '__new__',\n",
       " '__orig_bases__',\n",
       " '__reduce__',\n",
       " '__reduce_ex__',\n",
       " '__repr__',\n",
       " '__reversed__',\n",
       " '__setattr__',\n",
       " '__sizeof__',\n",
       " '__slots__',\n",
       " '__static_attributes__',\n",
       " '__str__',\n",
       " '__subclasshook__',\n",
       " '__weakref__',\n",
       " '_abc_impl',\n",
       " '_element_id',\n",
       " '_graph',\n",
       " '_id',\n",
       " '_labels',\n",
       " '_properties',\n",
       " 'element_id',\n",
       " 'get',\n",
       " 'graph',\n",
       " 'id',\n",
       " 'items',\n",
       " 'keys',\n",
       " 'labels',\n",
       " 'values']"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dir(r['p'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "cb6e6ae4-f23b-4d6d-a64f-11a4e56534fd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Person']"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "list(r['p'].labels)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "4f36b7b5-71fc-450b-a891-c423aeca073a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'m.title': 'That Thing You Do', 'p2.name': 'Charlize Theron'}\n",
      "{'m.title': 'That Thing You Do', 'p2.name': 'Tom Hanks'}\n",
      "{'m.title': 'That Thing You Do', 'p2.name': 'Liv Tyler'}\n",
      "The query `\n",
      "        MATCH (p:Person {name: \"Tom Hanks\"})-[r:DIRECTED]->(m)<-[:ACTED_IN]-(p2)\n",
      "        RETURN m.title, p2.name\n",
      "    ` returned 3 records in 25 ms.\n"
     ]
    }
   ],
   "source": [
    "with GraphDatabase.driver(NEO4J_URI, auth=AUTH) as driver:\n",
    "    driver.verify_connectivity()\n",
    "\n",
    "    records, summary, keys = driver.execute_query(\"\"\"\n",
    "        MATCH (p:Person {name: \"Tom Hanks\"})-[r:DIRECTED]->(m)<-[:ACTED_IN]-(p2)\n",
    "        RETURN m.title, p2.name\n",
    "    \"\"\",\n",
    "    database_=NEO4J_DATABASE,\n",
    ")\n",
    "\n",
    "# Loop through results and do something with them\n",
    "for record in records:\n",
    "    print(record.data())  # obtain record as dict\n",
    "\n",
    "# Summary information\n",
    "print(\"The query `{query}` returned {records_count} records in {time} ms.\".format(\n",
    "    query=summary.query, records_count=len(records),\n",
    "    time=summary.result_available_after\n",
    "))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "416e9193-f4b4-4ab3-9f82-49a3741ff2cb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'m.title': \"You've Got Mail\", 'p2.name': 'Meg Ryan'}\n",
      "{'m.title': \"You've Got Mail\", 'p2.name': 'Greg Kinnear'}\n",
      "{'m.title': \"You've Got Mail\", 'p2.name': 'Parker Posey'}\n",
      "{'m.title': \"You've Got Mail\", 'p2.name': 'Dave Chappelle'}\n",
      "{'m.title': \"You've Got Mail\", 'p2.name': 'Steve Zahn'}\n",
      "{'m.title': 'Sleepless in Seattle', 'p2.name': 'Meg Ryan'}\n",
      "{'m.title': 'Sleepless in Seattle', 'p2.name': 'Rita Wilson'}\n",
      "{'m.title': 'Sleepless in Seattle', 'p2.name': 'Bill Pullman'}\n",
      "{'m.title': 'Sleepless in Seattle', 'p2.name': 'Victor Garber'}\n",
      "{'m.title': 'Sleepless in Seattle', 'p2.name': \"Rosie O'Donnell\"}\n",
      "{'m.title': 'Joe Versus the Volcano', 'p2.name': 'Meg Ryan'}\n",
      "{'m.title': 'Joe Versus the Volcano', 'p2.name': 'Nathan Lane'}\n",
      "{'m.title': 'That Thing You Do', 'p2.name': 'Charlize Theron'}\n",
      "{'m.title': 'That Thing You Do', 'p2.name': 'Liv Tyler'}\n",
      "{'m.title': 'Cloud Atlas', 'p2.name': 'Hugo Weaving'}\n",
      "{'m.title': 'Cloud Atlas', 'p2.name': 'Halle Berry'}\n",
      "{'m.title': 'Cloud Atlas', 'p2.name': 'Jim Broadbent'}\n",
      "{'m.title': 'The Da Vinci Code', 'p2.name': 'Ian McKellen'}\n",
      "{'m.title': 'The Da Vinci Code', 'p2.name': 'Audrey Tautou'}\n",
      "{'m.title': 'The Da Vinci Code', 'p2.name': 'Paul Bettany'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'Bonnie Hunt'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'James Cromwell'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'Michael Clarke Duncan'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'David Morse'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'Sam Rockwell'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'Gary Sinise'}\n",
      "{'m.title': 'The Green Mile', 'p2.name': 'Patricia Clarkson'}\n",
      "{'m.title': 'Apollo 13', 'p2.name': 'Kevin Bacon'}\n",
      "{'m.title': 'Apollo 13', 'p2.name': 'Gary Sinise'}\n",
      "{'m.title': 'Apollo 13', 'p2.name': 'Ed Harris'}\n",
      "{'m.title': 'Apollo 13', 'p2.name': 'Bill Paxton'}\n",
      "{'m.title': 'Cast Away', 'p2.name': 'Helen Hunt'}\n",
      "{'m.title': \"Charlie Wilson's War\", 'p2.name': 'Philip Seymour Hoffman'}\n",
      "{'m.title': \"Charlie Wilson's War\", 'p2.name': 'Julia Roberts'}\n",
      "{'m.title': 'A League of Their Own', 'p2.name': \"Rosie O'Donnell\"}\n",
      "{'m.title': 'A League of Their Own', 'p2.name': 'Bill Paxton'}\n",
      "{'m.title': 'A League of Their Own', 'p2.name': 'Madonna'}\n",
      "{'m.title': 'A League of Their Own', 'p2.name': 'Geena Davis'}\n",
      "{'m.title': 'A League of Their Own', 'p2.name': 'Lori Petty'}\n",
      "The query `\n",
      "        MATCH (p:Person {name: \"Tom Hanks\"})-[r:ACTED_IN]->(m)<-[:ACTED_IN]-(p2)\n",
      "        RETURN m.title, p2.name\n",
      "    ` returned 39 records in 25 ms.\n"
     ]
    }
   ],
   "source": [
    "with GraphDatabase.driver(NEO4J_URI, auth=AUTH) as driver:\n",
    "    driver.verify_connectivity()\n",
    "\n",
    "    records, summary, keys = driver.execute_query(\"\"\"\n",
    "        MATCH (p:Person {name: \"Tom Hanks\"})-[r:ACTED_IN]->(m)<-[:ACTED_IN]-(p2)\n",
    "        RETURN m.title, p2.name\n",
    "    \"\"\",\n",
    "    database_=NEO4J_DATABASE,\n",
    ")\n",
    "\n",
    "# Loop through results and do something with them\n",
    "for record in records:\n",
    "    print(record.data())  # obtain record as dict\n",
    "\n",
    "# Summary information\n",
    "print(\"The query `{query}` returned {records_count} records in {time} ms.\".format(\n",
    "    query=summary.query, records_count=len(records),\n",
    "    time=summary.result_available_after\n",
    "))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b2a10586-379a-4e58-b211-249a7b27c508",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
